app/controllers/interviews_controller.rb

UPDATE "interviews" SET "question" = 'ffffffffff', "updated_at" = '2009-02-17 22:50:53' WHERE "id" = 1
---
  def update
    @interview.update_attributes(params[:interview])

SELECT * FROM "interviews"
---
  def index
    @interviews = Interview.all

SELECT * FROM "interviews" WHERE ("interviews"."id" = 3)
---
  def load_interview
    @interview = params[:id] ? Interview.find(params[:id] ) : Interview.new