app/controllers/responses_controller.rb

INSERT INTO "responses" ("user", "updated_at", "interview_id", "value", "comment", "created_at") VALUES(NULL, '2009-02-19 22:44:19', 3, 'option 2', 'sdafsadfasdfsadf', '2009-02-19 22:44:19')
---
  def create
    @response = @interview.responses.build(params[:response])
    if @response.save

SELECT * FROM "interviews" WHERE ("interviews"."id" = 3)
---
  def load_interview
    @interview = Interview.find(params[:interview_id])